*> This is the text editor interface.
IDENTIFICATION DIVISION.
PROGRAM-ID. SOLUTION.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  77 A PIC 99.
  77 B PIC 999.
  77 ANS PIC 99.

PROCEDURE DIVISION.
  MAIN-PARA.
    ACCEPT A.
    ACCEPT B.

  ADD-PARA.
    ADD A B GIVING ANS.

  DISPLAY-PARA.
    DISPLAY ANS.
STOP RUN.
